---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs
source: html/5c4cff4e-936e-1720-ca39-a3d62b9a52fc.htm
---
# ViewsExportingByContextEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.